[
  {
    "award": "Inspiring Leader Award 2020",
    "abstract": "Awarded by Inspiring Workplaces, I am very proud of being nominated and winning an Inspiring Leader Award in 2020 while working at GreenPath Financial Wellness. I believe that the award, and the comments of my peers and direct reports (shown below), speaks to the kind of leader that I always strive to be. Please click the award link (above) to visit the Inspiring Workplaces webpage for this award.",
    "url": "https://www.inspiring-workplaces.com/stories/winners-announced-inspiring-leaders-2020/",
    "blockquote": "When I started working with Tony, what kind of leader he is was immediately apparent. Tony shies away from praise and credit, instead reminding praise-givers that his team is responsible for any successes. I’ve seen members of his team doubt themselves at times, as we humans tend to do, and Tony is always there to remind them of their skills and talents. He is a developer, not only in the software sense, but in the human sense – Tony can see each person’s potential and is passionate about helping them realize it too.",
    "attribution": "a colleague endorsement from",
    "attributionSource": "GreenPath Financial Wellness",
    "endorsements": [
      {
        "header": "How has this person shown humanity in their leadership in 2020?",
        "comments": [
          "When I found out my bf's mom passed away, I wasn't sure if I would have to leave work early to be with him. When I let Tony know about it, he showed sympathy and said no problem; and didn't care if I would have to leave early for the day. I ended up not needing to, but it was calming to know that it wouldn't reflect negatively on me if I had. Tony has a lot of empathy and humanity!",
          "My dad currently suffers from heart failure and recently I needed to be available for him and my mom for doctor visits, etc. Tony empathized with our situation and provided moral support in our one-on-one meetings. Since the first time I shared the information with him, he always asks how my dad is doing. I think that is one of the awesome things about Tony. He really cares about his team members on a human level.",
          "Tony works in Mountain time while his entire team works in Eastern time. He makes sure he is available in early hours so his team is productive. He never complained once and makes it look like he is in the same time zone."
        ]
      },
      {
        "header": "How has this person shown courage in their leadership in 2020?",
        "comments": [
          "Tony defends his team. He always has the company needs in mind, but always makes sure that our needs are being met. If we need more time for something to make sure the project is better he will make sure we get it.",
          "By working with Tony, I could not tell that he has been at GreenPath for less than a year. Talk about making an impact in a short period of time. I think he has checked that box!",
          "Tony is always open to our suggestions and concerns. He finds ways to improve ourselves as developers and critical thinkers. I consider Tony as a great mentor who cares about each team member."
        ]
      },
      {
        "header": "How has this person shown communication in their leadership in 2020?",
        "comments": [
          "Tony said something to me that I've never heard another manager say in my many years as a software developer. He said that the people on his team are the most important priority to him. Not the work, not the IT outlook in a number of years, not the code; but the People.",
          "Tony is inspiring and motivating in his communication. He does not hide the hard truths but uses them to inspire us to think big."
        ]
      },
      {
        "header": "How has this person been empowering in 2020?",
        "comments": [
          "Tony is very good at recognizing each individual's skills and talents. He regularly points these out, celebrates them, and references them as a reminder if anyone is experiencing self-doubt.",
          "Tony selflessly and enthusiastically took on the responsibility for managing my tech internship, something that is helping me grow professionally into the career I've dreamed of!",
          "I couldn't ask for a more supportive leader. He has an amazing sense for when he needs to provide guidance, while still empowering us to make decisions (and yes, he respects those decisions). It's obvious that each member of the team is a priority for him. He has helped me to grow significantly in the few months we've been working together, and I believe that each member of the team would likely say the same.",
          "Tony gives us the space to work how we want and trusts that we are here for the greater good - this makes me feel empowered to make decisions and give my best work.",
          "Tony has been so supportive of me in the new position. He gives me time at a moment’s notice to make sure I am successful in my job. He gets truly excited when I complete tasks or get some builds/deploys running for the team. He is so grateful for everyone’s hard work and effort. He has really helped to direct me in what to learn as I am getting up to speed. He is very knowledgeable and always willing to share that with the team. He has really lifted this team to new heights!"
        ]
      },
      {
        "header": "Other Endorsements",
        "comments": [
          "Tony doesn't like to take individual credit for the work the IT department does, he continually reinforces that any successes are a result of everyone on the team working together. That speaks volumes about the kind of leader he is.",
          "Tony has adapted so well in the Team in a short amount of time. I value his involvement and openness to get everyone’s opinion and not just telling us what to do. I like how he wants to understand what we are working on and get a feel of what we have to go through in our routines, I value that a lot. He is always encouraging us and makes us feel empowered with our work."
        ]
      }
    ]
  }
]
