[
  "I'm Tony. I don't really go by Anthony much. I am married, and live in Denver with my wife. We have two children, but they are both married and living their lives. My hobbies are designing board games (really nerdy and long games about operating railroad companies), doing yoga, riding my Peloton bike and power-walking on the treadmill, and hiking. I also love history.",
  "When I am at work, leading software teams to success is my passion, it is what I love to do. I only succeed if the teams succeed. The team are the real stars of the show (not me) and I like to see the whole team in the spotlight and support them with everything I have to offer. I love working with engineering teams in developing, testing, and remedying technical engineering problems, and using my project management and team leadership abilities to aid the team. From determining project requirements, project scope, and delegating duties to overseeing software engineering functions, I excel at driving all phases of engineering projects from start to finish. I can also contribute technically to the team's success.",
  "The old saying is spot on: people are a company's most important resource. Because I believe in this, my personal mantra is what I call \"the three P's\". I believe that people, process, and products are the things that create success for teams, for companies, for customers, and for me. When you a great staff of people, that are working efficiently and in an organized manner, and they have awesome products to build, sell, and support, the company, the employees, and the customers will all have success.",
  "I also enjoy working with product management, product users, and internal/external stakeholders at all levels. I am a good bridge of information going both ways as I am able to speak technically and non-technically. I am a proponent of Agile processes. I have successfully introduced Agile, and operated Agile software teams. While there is no “silver bullet” when it comes to process, I do believe that Agility gives us all our best ability to execute on our opportunities.",
  "I have continually demonstrated an outstanding ability to hire, onboard, coach, train, develop, and lead software and quality engineers while boosting morale, on-the-job performance, and employee retention. This includes working with team members in geographically dispersed locations. ",
  "In 2020, I received an Inspiring Leader Award – what makes me proud of this award is that it is reflective of my investment into my team members. Their success, growth, motivation, accomplishments, and retention are to the benefit of everyone. I have also served on in-company diversity, equity, and inclusion committees. ",
  "I always want an opportunity to be a positive force for people, process, and products, be part of a talented team, and contribute to a mission-driven organization."
]
